"""
问题: 判断一个数独棋盘是否合法

例：
输入: board =
[["5","3",".",".","7",".",".",".","."]
,["6",".",".","1","9","5",".",".","."]
,[".","9","8",".",".",".",".","6","."]
,["8",".",".",".","6",".",".",".","3"]
,["4",".",".","8",".","3",".",".","1"]
,["7",".",".",".","2",".",".",".","6"]
,[".","6",".",".",".",".","2","8","."]
,[".",".",".","4","1","9",".",".","5"]
,[".",".",".",".","8",".",".","7","9"]]
输出: true

条件:
1. board.length == 9
2. board[i].length == 9
3. board[i][j] is a digit 1-9 or '.'
"""

class Solution(object):
    """
    思路: (关键是如何计算子矩阵的索引)
        1. 创建3个数组分别记录行、列、子盒子的元素
        2. 遍历棋盘，如果当前元素不是'.', 则判断当前元素是否在行、列、子盒子中, 如果存在则返回false
        3. 如果当前元素不存在，则将其添加到对应的行、列、子盒子中
        4. 遍历结束, 返回true
    """
    def isValidSudoku(self, board):
        """
        :type board: List[List[str]]
        :rtype: bool
        """
        rows        =       [set() for _ in range(9)]
        cols        =       [set() for _ in range(9)]
        subboxes    =       [set() for _ in range(9)]

        for i in range(9):
            for j in range(9):
                c = board[i][j]
                if c == '.': continue
                subid = (i // 3) * 3 + (j // 3) # * 计算子矩阵的索引
                if c in rows[i] or c in cols[j] or c in subboxes[subid]:
                    return False
                rows[i].add(c)
                cols[j].add(c)
                subboxes[subid].add(c)
        
        return True

if __name__ == "__main__":
    board = \
    [["8","3",".",".","7",".",".",".","."]
    ,["6",".",".","1","9","5",".",".","."]
    ,[".","9","8",".",".",".",".","6","."]
    ,["8",".",".",".","6",".",".",".","3"]
    ,["4",".",".","8",".","3",".",".","1"]
    ,["7",".",".",".","2",".",".",".","6"]
    ,[".","6",".",".",".",".","2","8","."]
    ,[".",".",".","4","1","9",".",".","5"]
    ,[".",".",".",".","8",".",".","7","9"]]
    print(f'board={board}')
    print(f'solution={Solution().isValidSudoku(board)}')